<!DOCTYPE html>
<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/cloud.css">
<title>Le Cloud ou Cloud Computing</title>
</head>
<body>
<div align="right"> <a href = "../index.htm"</div> Accueil</a>
<div align="center">
<h1>Le Cloud</h1>
<h2>Introduction</h2>
<p>Le cloud computing1, ou l&#145;informatique en nuage ou nuagique ou encore l&#145;infonuagique (au Qu&eacute;bec), est
 l&#145;exploitation de la puissance de calcul ou de stockage de serveurs informatiques distants par l&#145;interm&eacute;diaire d&#145;un r&eacute;seau, 
 g&eacute;n&eacute;ralement Internet. Ces serveurs sont lou&eacute;s &agrave; la demande, le plus souvent par tranche d&#145;utilisation selon 
 des critères techniques (puissance, bande passante, etc.) mais &eacute;galement au forfait. Le cloud computing se 
 caract&eacute;rise par sa grande souplesse : selon le niveau de comp&eacute;tence de l&#145;utilisateur client, il est possible 
 de g&eacute;rer soi-même son serveur ou de se contenter d&#145;utiliser des applicatifs distants en mode SaaS2,3,4. 
 Selon la d&eacute;finition du National Institute of Standards and Technology (NIST), le cloud computing est l&#145;accès 
 via un r&eacute;seau de t&eacute;l&eacute;communications, &agrave; la demande et en libre-service, &agrave; des ressources informatiques partag&eacute;es configurables5. 
 Il s&#145;agit donc d&#145;une d&eacute;localisation de l&#145;infrastructure informatique.

Les grandes entreprises du secteur informatique comme IBM, Microsoft, Google, Dell, Amazon et Oracle, Apple,
 Hewlett-Packard, Thales Services ou Orange Business Services font la promotion du cloud computing6, qui 
 constitue un important changement de paradigme des systèmes informatiques, jusque là constitu&eacute;s de 
 serveurs situ&eacute;s au sein même de l&#145;entreprise.</p>
 
<h2>I) Principes - Le nuage</h2>
<div id ="global">
<div id ="gauche" ><img src="../images/Nuage33.png"></div>
<div id ="droite">
<p>
Le nuage (anglais cloud) est un ensemble de mat&eacute;riel, de raccordements r&eacute;seau et de logiciels qui 
fournit des services sophistiqu&eacute;s que les individus et les collectivit&eacute;s peuvent exploiter &agrave; volont&eacute; 
depuis n&#145;importe où dans le monde2. Le cloud computing est un basculement de tendance : au lieu d&#145;obtenir
 de la puissance de calcul par acquisition de mat&eacute;riel et de logiciel, le consommateur se sert de 
 puissance mise &agrave; sa disposition par un fournisseur via Internet. <br/><br/>
 
 Les caract&eacute;ristiques essentielles d&#145;un nuage sont la disponibilit&eacute; mondiale en libre-service, l&#130;&eacute;lasticit&eacute;, l&#145;ouverture, la mutualisation et le paiement &agrave; l&#145;usage :<br/><br/>

&bull;ressources en libre-service : et adaptation automatique &agrave; la demande. La capacit&eacute; de stockage et la 
puissance de calcul sont adapt&eacute;es automatiquement au besoin d&#145;un consommateur. Ce qui contraste avec la 
technique classique des h&eacute;bergeurs où le consommateur doit faire une demande &eacute;crite &agrave; son fournisseur en 
vue d&#145;obtenir une augmentation de la capacit&eacute; - demande dont la prise en compte n&eacute;cessite &eacute;videmment un 
certain temps. En cloud computing la demande est automatique et la r&eacute;ponse est imm&eacute;diate11 ;<br/>
&bull;ouverture : les services de cloud computing sont mis &agrave; disposition sur l&#145;Internet, et utilisent des 
techniques standardis&eacute;es qui permettent de s&#145;en servir aussi bien avec un ordinateur qu&#145;un t&eacute;l&eacute;phone ou 
une tablette11 ;<br/>
&bull;mutualisation : elle permet de combiner des ressources h&eacute;t&eacute;rogènes (mat&eacute;riel, logiciel, trafic 
r&eacute;seau) en vue de servir plusieurs consommateurs &agrave; qui les ressources sont automatiquement attribu&eacute;es6. 
La mutualisation am&eacute;liore l&#130;&eacute;volutivit&eacute; et l&#130;&eacute;lasticit&eacute; et permet d&#145;adapter automatiquement les ressources 
aux variations de la demande6 ;<br/>
&bull;paiement &agrave; l&#145;usage : la quantit&eacute; de service consomm&eacute;e dans le cloud est mesur&eacute;e, &agrave; des fins de 
contrôle, d&#145;adaptation des moyens techniques et de facturation6.<br/>
Les nuages utilisent des technologies telles que la virtualisation du mat&eacute;riel informatique, les grilles, 
l&#145;architecture orient&eacute;e services et les services web2. Un nuage peut être public, priv&eacute; ou communautaire. 
Un nuage public est mis &agrave; disposition du grand public. Les services sont typiquement mis &agrave; disposition par
 une entreprise, qui manipule une infrastructure qui lui appartient11. Un nuage priv&eacute; est destin&eacute; exclusivement 
 &agrave; une organisation, qui peut le manipuler elle-même, ou faire appel &agrave; services fournis par des tiers11. 
 Dans un nuage communautaire l&#145;infrastructure provient d&#145;un ensemble de membres qui partagent un int&eacute;rêt 
 commun. Ce type de nuage est semblable &agrave; ceux mont&eacute;s par les milieux acad&eacute;miques pour des &eacute;tudes de grande
 envergure.
 
</p>
</div>
</div>
<h2>II) Services</h2>
&bull;SAAS = Software As A Service<br/>
<p>
En français logiciel en tant que service. Dans ce type de service, des applications sont mises &agrave; la 
disposition des consommateurs. Les applications peuvent être manipul&eacute;es &agrave; l&#145;aide d&#145;un navigateur web ou 
install&eacute;es de façon locative sur un PC, et le consommateur n&#145;a pas &agrave; se soucier d&#145;effectuer des mises &agrave; 
jour, d&#145;ajouter des patches de s&eacute;curit&eacute; et d&#145;assurer la disponibilit&eacute; du service. Gmail est un exemple de 
tel service. Il offre au consommateur un service de courrier &eacute;lectronique et le consommateur n&#145;a pas &agrave; se 
soucier de la manière dont le service est fourni11. Autre exemple, Office 365 propose un ensemble de 
services en abonnement dont la suite logicielle Office qui se met automatiquement &agrave; jour, l&#145;utilisateur 
ne se soucie pas de racheter un nouveau logiciel ou de le mettre &agrave; jour. On parle ici de location de 
services h&eacute;berg&eacute;s par Microsoft. D&#145;autres exemples de logiciels mis &agrave; disposition en Saas sont Google Apps,
 Office Online ou LotusLive (IBM).
</p>
&bull;PAAS = Platform As A Service<br/>
<p>
En français plate-forme en tant que service. Dans ce type de service, situ&eacute; juste au-dessus du pr&eacute;c&eacute;dent, 
le système d&#145;exploitation et les outils d&#145;infrastructure sont sous la responsabilit&eacute; du fournisseur. 
Le consommateur a le contrôle des applications et peut ajouter ses propres outils. 
La situation est analogue &agrave; celle de l&#145;h&eacute;bergement web où le consommateur loue l&#145;exploitation de 
serveurs sur lesquels les outils n&eacute;cessaires sont pr&eacute;alablement plac&eacute;s et contrôl&eacute;s par le fournisseur. 
La diff&eacute;rence &eacute;tant que les systèmes sont mutualis&eacute;s et offrent une grande &eacute;lasticit&eacute; - capacit&eacute; de
 s&#145;adapter automatiquement &agrave; la demande, alors que dans une offre classique d&#145;h&eacute;bergement web 
 l&#145;adaptation fait suite &agrave; une demande formelle du consommateur.
</p>
&bull;IAAS = Infrastructure As A Service<br/>
<p>
En français infrastructure en tant que service. C&#145;est le service de plus bas niveau. Il consiste &agrave; offrir un 
accès &agrave; un parc informatique virtualis&eacute;. Des machines virtuelles sur lesquelles le consommateur peut 
installer un système d&#145;exploitation et des applications. Le consommateur est ainsi dispens&eacute; de l&#145;achat de 
mat&eacute;riel informatique. Ce service s&#145;apparente aux services d&#145;h&eacute;bergement classiques des centre de traitement 
de donn&eacute;es, et la tendance est en faveur de services de plus haut niveau, qui font davantage abstraction de 
d&eacute;tails techniques.
</p>

<h2>III) Quelques acteurs</h2>

<TABLE> 
  <CAPTION>  </CAPTION> 
  <TR> 
 <TH> <img src="../images/amazon.jpg"> </TH> 
 <TH> <img src="../images/citrix.jpg"> </TH> 
 <TH> <img src="../images/google.jpg"> </TH> 
 <TH> <img src="../images/hp.jpg"> </TH> 
  </TR> 
  <TR> 
 <TH> <img src="../images/ibm.jpg"> </TH> 
 <TD> <img src="../images/microsoft.png"> </TD> 
 <TD> </TD> 
 <TD> </TD> 
  </TR> 
</TABLE> 

<h2>Conclusion</h2>

<div align="right"> <a href = "../index.htm"</div> Accueil</a>
</div>
</body>
</html>